Show / Hide Table of Contents
Class GrpcReflectionArgument
Represents an argument that Grpc will use to call the method invoked via reflection.
Inheritance
System.Object
GrpcReflectionArgument
Inherited Members
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaStatiCa.Plugin.Grpc.Reflection
Assembly: IdeaStatiCa.Plugin.dll
Syntax
public class GrpcReflectionArgument
Constructors
Improve this Doc   View Source
GrpcReflectionArgument()
Initializes an empty GrpcReflectionArgument
Declaration
public GrpcReflectionArgument()
Improve this Doc   View Source
GrpcReflectionArgument(String, Object)
Initializes a reflection argument with specified parameters.
Declaration
public GrpcReflectionArgument(string type, object value)
Parameters
 Type |  Name |  Description
 System.String |  type
 System.Object |  value
Properties
Improve this Doc   View Source
ParameterType
FullName of the arguments value type.
Declaration
public string ParameterType { get; set; }
Property Value
 Type |  Description
 System.String
Improve this Doc   View Source
Value
Value of the argument.
Declaration
public object Value { get; set; }
Property Value
 Type |  Description
 System.Object
 Improve this Doc
 View Source